# -*- coding: utf-8 -*-

TITLE_TH = [
    (u'นาย', 'นาย'),
    (u'นาง', 'นาง'),
    (u'นางสาว', 'นางสาว'),
    (u'อาจารย์', 'อาจารย์'),
    (u'ศาสตราจารย์', 'ศาสตราจารย์'),
    (u'รองศาสตราจารย์', 'รองศาสตราจารย์'),
    (u'ผู้ช่วยศาสตราจารย์', 'ผู้ช่วยศาสตราจารย์'),
    (u'ศาสตราจารย์นายแพทย์', 'ศาสตราจารย์นายแพทย์'),
    (u'ศาสตราจารย์แพทย์หญิง', 'ศาสตราจารย์แพทย์หญิง'),
    (u'แพทย์หญิง', 'แพทย์หญิง'),
    (u'นายแพทย์', 'นายแพทย์'),
    (u'ผศ.พญ.', 'ผศ.พญ.'),
    (u'ผศ.นพ.', 'ผศ.นพ.'),
    (u'ดร.', 'ดร.'),
]

TITLE_EN = [
    (u'Mr.', 'Mr.'),
    (u'Mrs', 'Mrs'),
    (u'Miss', 'Miss.'),
    (u'Asst.Prof', 'Asst.Prof'),
    (u'Assoc.Prof', 'Assoc.Prof'),
    (u'Prof', 'Prof'),
    (u'Dr.', 'Dr.'),
]

PROJECT_TYPE = [
    (u'โครงการฉบับเต็มรูปแบบ', u'โครงการฉบับเต็มรูปแบบ'),
    (u'โครงการฉบับย่อ', u'โครงการฉบับย่อ'),
    (u'โครงการที่ได้รับทุนสนับสนุนจากภาคเอกชน', u'โครงการที่ได้รับทุนสนับสนุนจากภาคเอกชน'),
]

PROJECT_TYPE_SUB = [
    (u'แบบสอบถาม', u'แบบสอบถาม/บทสัมภาษณ์'),
    (u'การศึกษาย้อนหลัง', u'การศึกษาย้อนหลัง/สิ่งส่งตรวจ'),
]

PROJECT_STATUS = [
    (u'ตรวจสอบ', u'ตรวจสอบ'),
    (u'กำลังพิจารณา', u'กำลังพิจารณา'),
    (u'อนุมัติ', u'อนุมัติ'),
    (u'ยกเลิก', u'ยกเลิก'),
]

